alpinelinux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-10-08 Sat 17:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>alpine linux</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">alpine linux</h1>
<p>
alpine linux is a minimalist linux distro with a super fast package
manager (apk)
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. manpages and other documentation</a></li>
<li><a href="#org0000001">2. mouse cursor not changing</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> manpages and other documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
install the <code>docs</code> metapackage to automatically download the
documentation, or install the packages suffixed with <code>-doc</code> to install
the documentation for a specific package
</p>

<p>
note that sometimes the <code>-doc</code> suffixed package is only for the main
package when you have a few packages with different configurations of
the same software, for example <code>emacs-x11</code> <code>emacs-gtk3</code> etc share the
<code>emacs-doc</code> package for their documentation (ew texinfo) which will
not automatically get pulled in by <code>docs</code>
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> mouse cursor not changing</h2>
<div class="outline-text-2" id="text-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-10-08 Sat]</span></span>: this has been bothering me for like a year, i
finally found the solution by accident today&#x2026;
</p>

<p>
if its stuck with the default pointer and never changes (ie when
hovering over text), you are probably missing a video driver. if using
intel graphics, the package is <code>xf86-video-intel</code>
</p>
</div>
</div>
</div>
</body>
</html>
